In [108]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [109]:
m33 = np.arange(9).reshape(3, 3)

In [110]:
ds = pd.Series([10, 20, 30, 40], [0, 1, 1, 2])
ds

0    10
1    20
1    30
2    40
dtype: int64

In [111]:
type(ds[0])

numpy.int64

In [112]:
ds1 = pd.Series([1,3], index=["a","c"])
ds2 = pd.Series([2,3], index=["a","c"])

print(ds1+ds2)

a    3
c    6
dtype: int64

In [113]:
s = pd.Series([1, 2, 3], name='xxx')

In [114]:
df = pd.DataFrame({'yyy': s})
df

   yyy
0    1
1    2
2    3

In [115]:
s[0] = 666
s

0    666
1      2
2      3
Name: xxx, dtype: int64

In [116]:
df

   yyy
0    1
1    2
2    3

In [117]:
df['yyy'][1]

2

In [118]:
drinks = pd.read_csv('drinks.csv')

In [119]:
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF

In [120]:
drinks.index

RangeIndex(start=0, stop=193, step=1)

In [128]:
by_country = drinks.set_index('country')
by_country.head()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
country,,,,,
Afghanistan,0,0,0,0.0,AS
Albania,89,132,54,4.9,EU
Algeria,25,0,14,0.7,AF
Andorra,245,138,312,12.4,EU
Angola,217,57,45,5.9,AF

In [126]:
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF

In [146]:
by_country.loc['Albania']

beer_servings                    89
spirit_servings                 132
wine_servings                    54
total_litres_of_pure_alcohol    4.9
continent                        EU
Name: Albania, dtype: object